dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
    if(half_scan_gpioa_pressed(GPIO_Pin_7) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_CENTER_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_7) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_UP_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_6) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_DOWN_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_5) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_RIGHT_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_4) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_LEFT_MASK;
    }

    return half_scan_debounce_u8(raw,
                                 CH585_LOCAL_SWITCH_CENTER_MASK |
                                     CH585_LOCAL_SWITCH_DIR_MASK,
                                 CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES,
                                 &s_local_switch_last_raw,
                                 &s_local_switch_raw_count,
                                 &s_local_switch_stable);
}

static void half_scan_apply_left_five_way(void)
{
    uint8_t stable = half_scan_local_switch_stable_mask();
    uint8_t center = (uint8_t)(stable & CH585_LOCAL_SWITCH_CENTER_MASK);
    uint8_t dirs = (uint8_t)(stable & CH585_LOCAL_SWITCH_DIR_MASK);

    if(center == 0U)
    {
        s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_NONE;
        s_local_switch_guard_frames = 0U;
        s_local_switch_enter_frames = 0U;
        return;
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_NONE)
    {
        s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_PENDING;
        s_local_switch_guard_frames = CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES;
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_PENDING)
    {
        if(dirs != 0U)
        {
            s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_DIR;
        }
        else if(s_local_switch_guard_frames != 0U)
        {
            s_local_switch_guard_frames--;
            return;
        }
        else
        {
            s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_ENTER;
            s_local_switch_enter_frames = CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES;
        }
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_ENTER)
    {
        if(s_local_switch_enter_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_CENTER);
            s_local_switch_enter_frames--;
        }
        return;
    }

    if(s_local_switch_gesture != CH585_LOCAL_SWITCH_GESTURE_DIR)
    {
        return;
    }

    if((dirs & CH585_LOCAL_SWITCH_UP_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_UP);
    }
    if((dirs & CH585_LOCAL_SWITCH_DOWN_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_DOWN);
    }
    if((dirs & CH585_LOCAL_SWITCH_RIGHT_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_RIGHT);
    }
    if((dirs & CH585_LOCAL_SWITCH_LEFT_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_LEFT);
    }
}

static void half_scan_local_button_poll(void)
{
    uint8_t stable = half_scan_debounce_u8(half_scan_gpioa_pressed(GPIO_Pin_7),
                                          1U,
                                          CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES,
                                          &s_local_button_last_raw,
                                          &s_local_button_raw_count,
                                          &s_local_button_stable);

    if((stable != 0U) && (s_local_button_last_stable == 0U))
    {
        s_local_button_mute_frames = CH585_LOCAL_BUTTON_PULSE_FRAMES;
    }
    s_local_button_last_stable = stable;
}

static void half_scan_apply_local_inputs(void)
{
    if(CH585_HALF_ID == AIK_HALF_ID_LEFT)
    {
        half_scan_apply_left_five_way();
    }
    else
    {
        half_scan_local_rotary_poll();
        half_scan_local_button_poll();
        if(s_local_rotary_cw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_CW);
            s_local_rotary_cw_frames--;
        }
        if(s_local_rotary_ccw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_CCW);
            s_local_rotary_ccw_frames--;
        }
        if(s_local_button_mute_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_MUTE);
            s_local_button_mute_frames--;
        }
    }
}

static void half_scan_compact_raw(const ch585_ads7948_mux_acq_t *acq,
                                  uint16_t *compact,
                                  uint8_t key_count)
{
    const uint16_t *raw;
    const ch585_ads7948_mux_profile_t *profile;
    uint8_t key = 0U;
    uint8_t lane_index;

    if((acq == 0) || (compact == 0) || (acq->profile == 0))
    {
        return;
    }

    raw = ch585_ads7948_mux_acq_raw(acq);
    profile = acq->profile;
    for(lane_index = 0U;
        (lane_index < CH585_ADS7948_MUX_LANE_COUNT) && (key < key_count);
        lane_index++)
    {
        const ch585_ads7948_mux_lane_t *lane = &profile->lanes[lane_index];
        uint8_t mux;
        uint8_t mux_end = (uint8_t)(lane->mux_first + lane->mux_count);

        for(mux = lane->mux_first; (mux < mux_end) && (key < key_count); mux++)
        {
            uint16_t raw_index =
                ((uint16_t)lane_index * CH585_ADS7948_MUX_MUX_CHANNEL_COUNT) +
                (uint16_t)mux;

            compact[key++] = raw[raw_index];
        }
    }

    while(key < key_count)
    {
        compact[key++] = 0U;
    }
}

static void half_scan_build_frame(void)
{
    s_tx_frame.half_seq++;
    half_scan_build_down_bits();
    half_scan_apply_local_inputs();
    aik_spi_half_state_finish(&s_tx_frame,
                              aik_spi_half_frame_bits((uint8_t)CH585_HALF_ID));
}

static void half_scan_prepare_profile_status(uint16_t ack_seq)
{
    memset(&s_profile_status, 0, sizeof(s_profile_status));
    s_profile_status.ack_seq = ack_seq;
    s_profile_status.half_id = (uint8_t)CH585_HALF_ID;
    s_profile_status.flags = AIK_PROFILE_STATUS_FLAG_VALID |
                             AIK_PROFILE_STATUS_FLAG_DEFAULT;
    s_profile_status.profile_id16 = AIK_PROFILE_DEBUG_ID16;
    s_profile_status.generation16 = AIK_PROFILE_DEBUG_GENERATION16;
    aik_spi_profile_status_finish(&s_profile_status);
    s_profile_status_pending = 1U;
}

#if CH585_BLE_HID_ENABLE
static void half_scan_nkro16_to_boot8(const uint8_t nkro16[AIK_NKRO_REPORT_BYTES],
                                      uint8_t boot8[BLE_HID_KBD_REPORT_LEN])
{
    uint8_t byte_index;
    uint8_t out_index = 2U;

    memset(boot8, 0, BLE_HID_KBD_REPORT_LEN);
    boot8[0] = nkro16[0];

