dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
    for(byte_index = 2U;
        (byte_index < AIK_NKRO_REPORT_BYTES) && (out_index < BLE_HID_KBD_REPORT_LEN);
        byte_index++)
    {
        uint8_t bits = nkro16[byte_index];
        uint8_t bit;

        for(bit = 0U; (bit < 8U) && (out_index < BLE_HID_KBD_REPORT_LEN); bit++)
        {
            if((bits & (uint8_t)(1U << bit)) != 0U)
            {
                boot8[out_index++] =
                    (uint8_t)(0x04U + ((byte_index - 2U) * 8U) + bit);
            }
        }
    }
}

static void half_scan_boot8_add_usage(uint8_t boot8[BLE_HID_KBD_REPORT_LEN],
                                      uint8_t usage)
{
    uint8_t i;

    if((boot8 == 0) || (usage == 0U))
    {
        return;
    }

    for(i = 2U; i < BLE_HID_KBD_REPORT_LEN; i++)
    {
        if(boot8[i] == usage)
        {
            return;
        }
        if(boot8[i] == 0U)
        {
            boot8[i] = usage;
            return;
        }
    }
}
#endif

#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static uint8_t half_scan_sanitize_output_mode(uint8_t mode)
{
    if((mode == AIK_OUTPUT_MODE_RF24) || (mode == AIK_OUTPUT_MODE_BLE))
    {
        return mode;
    }
    return AIK_OUTPUT_MODE_USBHS;
}

static uint8_t half_scan_host_output_mode(uint8_t cmd, uint8_t flags)
{
    uint8_t mode = half_scan_sanitize_output_mode(
        (uint8_t)(flags & AIK_SPI_FLAG_OUTPUT_MODE_MASK));

#if CH585_RF_TX_ENABLE && !CH585_BLE_HID_ENABLE
    if((cmd == AIK_SPI_CMD_POLL_WITH_RF) ||
       (cmd == AIK_SPI_CMD_PUSH_RIGHT_STATE))
    {
        mode = AIK_OUTPUT_MODE_RF24;
    }
#else
    (void)cmd;
#endif

    return mode;
}

static void half_scan_set_output_mode(uint8_t mode)
{
    mode = half_scan_sanitize_output_mode(mode);
    if(s_output_mode == mode)
    {
        return;
    }

    if(mode == AIK_OUTPUT_MODE_RF24)
    {
#if CH585_BLE_HID_ENABLE
        BLE_HID_SetEnabled(0U);
#endif
#if CH585_RF_TX_ENABLE
        ch585_rf_nkro_tx_set_enabled(1U);
#endif
    }
    else if(mode == AIK_OUTPUT_MODE_BLE)
    {
#if CH585_RF_TX_ENABLE
        ch585_rf_nkro_tx_set_enabled(0U);
#endif
#if CH585_BLE_HID_ENABLE
        BLE_HID_SetEnabled(1U);
#endif
    }
    else
    {
#if CH585_RF_TX_ENABLE
        ch585_rf_nkro_tx_set_enabled(0U);
#endif
#if CH585_BLE_HID_ENABLE
        BLE_HID_SetEnabled(0U);
#endif
    }

#if CH585_BLE_HID_ENABLE
    if(mode != AIK_OUTPUT_MODE_BLE)
    {
        memset(s_ble_boot8, 0, sizeof(s_ble_boot8));
    }
#endif
    s_output_mode = mode;
}

static void half_scan_output_nkro16(const uint8_t nkro16[AIK_NKRO_REPORT_BYTES],
                                    uint16_t consumer_usage,
                                    uint16_t host_seq,
                                    uint8_t output_mode)
{
    half_scan_set_output_mode(output_mode);

#if CH585_RF_TX_ENABLE
    if(s_output_mode == AIK_OUTPUT_MODE_RF24)
    {
        ch585_rf_nkro_tx_set_report(nkro16,
                                    consumer_usage,
                                    host_seq,
                                    s_output_mode);
    }
#else
    (void)host_seq;
    (void)consumer_usage;
#endif

#if CH585_BLE_HID_ENABLE
    if(s_output_mode == AIK_OUTPUT_MODE_BLE)
    {
        uint8_t next_boot8[BLE_HID_KBD_REPORT_LEN];

        half_scan_nkro16_to_boot8(nkro16, next_boot8);
        if(consumer_usage == AIK_CONSUMER_USAGE_MUTE)
        {
            half_scan_boot8_add_usage(next_boot8, CH585_HID_KEYBOARD_MUTE);
        }
        else if(consumer_usage == AIK_CONSUMER_USAGE_VOLUME_UP)
        {
            half_scan_boot8_add_usage(next_boot8, CH585_HID_KEYBOARD_VOLUME_UP);
        }
        else if(consumer_usage == AIK_CONSUMER_USAGE_VOLUME_DOWN)
        {
            half_scan_boot8_add_usage(next_boot8, CH585_HID_KEYBOARD_VOLUME_DOWN);
        }

        if(memcmp(s_ble_boot8, next_boot8, sizeof(s_ble_boot8)) != 0)
        {
            uint8_t status = BLE_HID_SendKeyboard(next_boot8);

            if(status == SUCCESS)
            {
                memcpy(s_ble_boot8, next_boot8, sizeof(s_ble_boot8));
                s_ble_sent_count++;
            }
            else
            {
                s_ble_drop_count++;
            }
        }
    }
#else
    (void)output_mode;
#endif
}
#endif

static void half_scan_apply_host_cmd(void)
{
    if(aik_spi_host_cmd_valid(&s_rx_cmd) == 0U)
    {
        return;
    }

    if(s_rx_cmd.cmd == AIK_SPI_CMD_GET_PROFILE_STATUS)
    {
        half_scan_prepare_profile_status(s_rx_cmd.host_seq);
        return;
    }

#if CH585_SPI_ACCEPT_HOST_CMD
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
    if(s_rx_cmd.cmd == AIK_SPI_CMD_POLL)
    {
        uint8_t output_mode = half_scan_host_output_mode(s_rx_cmd.cmd,
                                                         s_rx_cmd.flags);
        half_scan_set_output_mode(output_mode);
    }
    else if(s_rx_cmd.cmd == AIK_SPI_CMD_POLL_WITH_RF)
    {
        uint8_t output_mode = half_scan_host_output_mode(s_rx_cmd.cmd,
                                                         s_rx_cmd.flags);
        memcpy(s_rf_nkro16, s_rx_cmd.nkro16, sizeof(s_rf_nkro16));
        half_scan_output_nkro16(s_rf_nkro16,
                                aik_spi_host_cmd_consumer_usage(&s_rx_cmd),
                                s_rx_cmd.host_seq,
                                output_mode);
    }
    else if(s_rx_cmd.cmd == AIK_SPI_CMD_PUSH_RIGHT_STATE)
    {
        aik_spi_half_state_v1_t next_right;
        uint8_t output_mode = half_scan_host_output_mode(s_rx_cmd.cmd,
                                                         s_rx_cmd.flags);

        memcpy(&next_right, s_rx_cmd.nkro16, sizeof(next_right));
        if(aik_spi_half_state_valid(&next_right) == 0U)
        {
            return;
        }

        s_right_frame = next_right;
        s_right_frame_valid = 1U;
        ch585_half_report_build_nkro16(&s_tx_frame,
                                       s_right_frame_valid ? &s_right_frame : 0,
                                       s_rf_nkro16);
        half_scan_output_nkro16(s_rf_nkro16,
                                ch585_half_report_consumer_usage(
                                    &s_tx_frame,
                                    s_right_frame_valid ? &s_right_frame : 0),
                                s_rx_cmd.host_seq,
                                output_mode);
    }
#endif
#else
    (void)s_rx_cmd;
#endif
}

#if CH585_HALF_SCAN_DEBUG_UART
static void half_scan_debug_uart_init(void)
{
    GPIOPinRemap(DISABLE, RB_PIN_UART1);
    GPIOA_SetBits(GPIO_Pin_9);
    GPIOA_ModeCfg(GPIO_Pin_8, GPIO_ModeIN_PU);
    GPIOA_ModeCfg(GPIO_Pin_9, GPIO_ModeOut_PP_5mA);
    UART1_DefInit();
    UART1_BaudRateCfg(CH585_HALF_SCAN_DEBUG_UART_BAUD);
}

static uint8_t half_scan_debug_first_down(uint8_t key_count)
{
    uint8_t key;

