dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
    for(key = 0U; key < key_count; key++)
    {
        if((s_tx_frame.down_bits[key >> 3] & (uint8_t)(1U << (key & 7U))) != 0U)
        {
            return key;
        }
    }
    return 0xFFU;
}

static void half_scan_debug_poll(uint8_t key_count)
{
    ch585_spi0_slave_link_stats_t spi_stats;
    uint16_t host_crc;
    uint16_t host_calc_crc;
    uint8_t key;
    uint8_t min_raw_key = 0U;
    uint8_t max_pos_key = 0U;
    uint16_t min_raw = 0xFFFFU;
    uint16_t max_pos = 0U;
#if CH585_SPI_ACCEPT_HOST_CMD
    uint8_t host_ok = aik_spi_host_cmd_valid(&s_rx_cmd);
#else
    uint8_t host_ok = 0U;
#endif

    if((s_tx_frame.half_seq % CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES) != 0U)
    {
        return;
    }

    for(key = 0U; key < key_count; key++)
    {
        const mag_key_state_t *state = mag_key_engine_state(&s_engine, key);

        if(state == 0)
        {
            continue;
        }

        if(state->raw_adc < min_raw)
        {
            min_raw = state->raw_adc;
            min_raw_key = key;
        }
        if(state->position_pm > max_pos)
        {
            max_pos = state->position_pm;
            max_pos_key = key;
        }
    }

    ch585_spi0_slave_link_get_stats(&spi_stats);
    host_crc = s_rx_cmd.crc16;
    host_calc_crc = aik_spi_host_cmd_crc(&s_rx_cmd);
    PRINT("hs half=%u seq=%u scan=%lu raw_min=%u:%u pos_max=%u:%u down=%02x%02x%02x%02x%02x%02x first=%u out=%u spi=%lu abort=%lu last=%d host=%u cmd=%u hseq=%u rxcnt=%u rx=%02x%02x%02x%02x hcrc=%04x/%04x\r\n",
          (unsigned int)CH585_HALF_ID,
          (unsigned int)s_tx_frame.half_seq,
          (unsigned long)s_acq.frames,
          (unsigned int)min_raw_key,
          (unsigned int)min_raw,
          (unsigned int)max_pos_key,
          (unsigned int)max_pos,
          (unsigned int)s_tx_frame.down_bits[0],
          (unsigned int)s_tx_frame.down_bits[1],
          (unsigned int)s_tx_frame.down_bits[2],
          (unsigned int)s_tx_frame.down_bits[3],
          (unsigned int)s_tx_frame.down_bits[4],
          (unsigned int)s_tx_frame.down_bits[5],
          (unsigned int)half_scan_debug_first_down(key_count),
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
          (unsigned int)s_output_mode,
#else
          (unsigned int)AIK_OUTPUT_MODE_USBHS,
#endif
          (unsigned long)spi_stats.frames,
          (unsigned long)spi_stats.aborts,
          s_last_spi_result,
          (unsigned int)host_ok,
          (unsigned int)s_rx_cmd.cmd,
          (unsigned int)s_rx_cmd.host_seq,
          (unsigned int)spi_stats.last_rx_count,
          (unsigned int)spi_stats.last_rx_head[0],
          (unsigned int)spi_stats.last_rx_head[1],
          (unsigned int)spi_stats.last_rx_head[2],
          (unsigned int)spi_stats.last_rx_head[3],
          (unsigned int)host_crc,
          (unsigned int)host_calc_crc);
#if CH585_BLE_HID_ENABLE
    PRINT("ble conn=%u sent=%lu drop=%lu boot=%02x %02x %02x %02x %02x %02x %02x %02x\r\n",
          (unsigned int)BLE_HID_IsConnected(),
          (unsigned long)s_ble_sent_count,
          (unsigned long)s_ble_drop_count,
          (unsigned int)s_ble_boot8[0],
          (unsigned int)s_ble_boot8[1],
          (unsigned int)s_ble_boot8[2],
          (unsigned int)s_ble_boot8[3],
          (unsigned int)s_ble_boot8[4],
          (unsigned int)s_ble_boot8[5],
          (unsigned int)s_ble_boot8[6],
          (unsigned int)s_ble_boot8[7]);
#endif
}
#else
static void half_scan_debug_uart_init(void)
{
}

static void half_scan_debug_poll(uint8_t key_count)
{
    (void)key_count;
}
#endif

static void half_scan_init(void)
{
    const ch585_ads7948_mux_profile_t *profile = ch585_ads7948_mux_profile(half_scan_side());
    mag_key_config_t cfg;

    HSECFG_Capacitance(HSECap_18p);
    SetSysClock(SYSCLK_FREQ);
    half_scan_debug_uart_init();
    PRINT("half_scan start half=%u sys=%lu keys=%u rf=%u ble=%u uart_dbg=%u\r\n",
          (unsigned int)CH585_HALF_ID,
          (unsigned long)GetSysClock(),
          (unsigned int)aik_spi_half_key_count((uint8_t)CH585_HALF_ID),
          (unsigned int)CH585_RF_TX_ENABLE,
          (unsigned int)CH585_BLE_HID_ENABLE,
          (unsigned int)CH585_HALF_SCAN_DEBUG_UART);
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
    CH58x_BLEInit();
#endif
    HAL_Init();

    memset(&s_acq, 0, sizeof(s_acq));
    memset(&s_engine, 0, sizeof(s_engine));
    memset(&s_tx_frame, 0, sizeof(s_tx_frame));
    memset(&s_rx_cmd, 0, sizeof(s_rx_cmd));
    memset(&s_profile_status, 0, sizeof(s_profile_status));
    memset(&s_right_frame, 0, sizeof(s_right_frame));
    memset(s_rf_nkro16, 0, sizeof(s_rf_nkro16));
    memset(s_compact_raw, 0, sizeof(s_compact_raw));
    s_last_spi_result = 0;
    s_profile_status_pending = 0U;
    s_right_frame_valid = 0U;
#if CH585_BLE_HID_ENABLE
    memset(s_ble_boot8, 0, sizeof(s_ble_boot8));
    s_ble_sent_count = 0U;
    s_ble_drop_count = 0U;
#endif
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
    s_output_mode = 0xFFU;
#endif

    ch585_ads7948_mux_gpio_init();
    half_scan_local_gpio_init();
    (void)ch585_ads7948_mux_acq_init(&s_acq, profile);

    mag_key_default_config(&cfg);
    cfg.mode = MAG_KEY_MODE_RAPID_TRIGGER;
    (void)mag_key_engine_init(&s_engine,
                              aik_spi_half_key_count((uint8_t)CH585_HALF_ID),
                              &cfg);

    ch585_spi0_slave_link_init();
#if CH585_RF_TX_ENABLE
    ch585_rf_nkro_tx_init();
#endif
#if CH585_BLE_HID_ENABLE
    BLE_HID_Init();
#endif
#if CH585_RF_TX_ENABLE && CH585_BLE_HID_ENABLE
    half_scan_set_output_mode(AIK_OUTPUT_MODE_USBHS);
#elif CH585_RF_TX_ENABLE
    half_scan_set_output_mode(AIK_OUTPUT_MODE_RF24);
#elif CH585_BLE_HID_ENABLE
    half_scan_set_output_mode(AIK_OUTPUT_MODE_BLE);
#endif

    ch585_ads7948_mux_acq_poll(&s_acq);
    half_scan_compact_raw(&s_acq,
                          s_compact_raw,
                          aik_spi_half_key_count((uint8_t)CH585_HALF_ID));
    (void)mag_key_engine_update(&s_engine, s_compact_raw);
    half_scan_build_frame();
}

int main(void)
{
    half_scan_init();

    while(1)
    {
        uint8_t key_count = aik_spi_half_key_count((uint8_t)CH585_HALF_ID);

        s_last_spi_result =
            ch585_spi0_slave_link_receive_frame((uint8_t *)&s_rx_cmd,
                                                AIK_SPI_HOST_CMD_SIZE);
        if(s_last_spi_result == CH585_SPI0_SLAVE_LINK_OK)
        {
            half_scan_apply_host_cmd();
        }
        if(s_profile_status_pending != 0U)
        {
            s_last_spi_result =
                ch585_spi0_slave_link_serve_tx_frame(
                    (const uint8_t *)&s_profile_status,
                    AIK_SPI_HALF_STATE_SIZE);
            s_profile_status_pending = 0U;
        }
        else
        {
            s_last_spi_result =
                ch585_spi0_slave_link_serve_tx_frame(
                    (const uint8_t *)&s_tx_frame,
                    AIK_SPI_HALF_STATE_SIZE);
        }
        ch585_ads7948_mux_acq_poll(&s_acq);
        half_scan_compact_raw(&s_acq, s_compact_raw, key_count);
        (void)mag_key_engine_update(&s_engine, s_compact_raw);
        half_scan_build_frame();
        half_scan_debug_poll(key_count);
#if CH585_RF_TX_ENABLE
        ch585_rf_nkro_tx_poll();
#elif CH585_BLE_HID_ENABLE
        TMOS_SystemProcess();
#endif
    }
}
